docker-swarm/tsung-benchmark/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="100000"></client>
    </clients>

    <servers>
        <!-- connect to the load balancer -->
        <server host="agents-sim.xyz" port="5222" type="tcp"></server>
    </servers>

    <load>
        <!-- connect users -->
        <arrivalphase phase="1" duration="15" unit="minute">
            <users maxnumber="8000" interarrival="0.05" unit="second"></users>
        </arrivalphase>
    </load>

    <options>
        <option name="max_retries" value="10" />
        <option name="rate_limit" value="4096"></option>
        <option name="seed" value="42"/>
        <option type="ts_jabber" name="global_number" value="8000"></option>
        <option type="ts_jabber" name="userid_max" value="100000"></option>
        <option type="ts_jabber" name="domain" value="agents-sim.xyz"></option>
        <option type="ts_jabber" name="username" value="benchmark_user"></option>
        <option type="ts_jabber" name="passwd" value="password"></option>
    </options>

    <sessions>
        <session probability="100" name="jabber-session" type="ts_jabber" bidi="true">
            <request>
                <jabber type="connect" ack="no_ack"></jabber>
            </request>

            <transaction name="authenticate">
                <request>
                    <jabber type="auth_sasl" ack="local"></jabber>
                </request>

                <request>
                    <jabber type="connect" ack="local"></jabber>
                </request>

                <request>
                    <jabber type="auth_sasl_bind" ack="local" ></jabber>
                </request>

                <request>
                    <jabber type="auth_sasl_session" ack="local" ></jabber>
                </request>
            </transaction>

            <!-- set status to 'online' -->
            <request>
                <jabber type="presence:initial" ack="no_ack"/>
            </request>

            <!-- wait for other connected clients clients -->
            <request>
                <jabber type="presence" ack="global"/>
            </request>

            <!-- send a message every second for 15 minutes -->
            <for from="1" to="900" incr="1" var="counter">
                <request>
                    <jabber type="chat" ack="no_ack" size="256"></jabber>
                </request>
                <thinktime value="1" />
            </for>

            <transaction name="close">
                <request>
                    <jabber type="close" ack="no_ack"></jabber>
                </request>
            </transaction>
        </session>
    </sessions>
</tsung>